IRP/src/AccumulationRegisters/R9541T_VacationUsage/R9541T_VacationUsage.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R9541T_VacationUsage</name>
 <resources>
  <name>Days</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>5</precision>
   </numberQualifiers>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Employee</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/AccumulationRegisters/R9541T_VacationUsage/ManagerModule.bsl
#Region AccessObject

// Get access key.
// See Role.TemplateAccumulationRegisters - Parameters orders has to be the same
// 
// Returns:
//  Structure - Get access key:
// * Company - CatalogRef.Companies -
// * Branch - CatalogRef.BusinessUnits -
Function GetAccessKey() Export
	AccessKeyStructure = New Structure;
	AccessKeyStructure.Insert("Company", Catalogs.Companies.EmptyRef());
	Return AccessKeyStructure;
EndFunction

#EndRegion

// Additional data filling.
// 
// Parameters:
//  MovementsValueTable - ValueTable
Procedure AdditionalDataFilling(MovementsValueTable) Export
	Return;	
EndProcedure

Function GetAvailableDays(Company, Employee, Date) Export
	
	Query = New Query;
	Query.Text =
		"SELECT ALLOWED
		|	R9541T_VacationUsageBalance.Employee,
		|	R9541T_VacationUsageBalance.DaysBalance AS Days
		|FROM
		|	AccumulationRegister.R9541T_VacationUsage.Balance(&Date, Company = &Company
		|	AND Employee = &Employee) AS R9541T_VacationUsageBalance
		|WHERE
		|	R9541T_VacationUsageBalance.DaysBalance > 0";
	
	Query.SetParameter("Date", Date);
	Query.SetParameter("Company", Company);
	Query.SetParameter("Employee", Employee);
	
	QuerySelection = Query.Execute().Select();
	If QuerySelection.Next() Then
		Return QuerySelection.Days;
	EndIf;
	
	Return 0;
	
EndFunction
